Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
 /**
 ******************************************************************************
 * @file    cmw_camera.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include "cmw_camera.h"

#include "isp_api.h"
#include "stm32n6xx_hal_dcmipp.h"
#include "cmw_utils.h"
#include "cmw_io.h"
#if defined(USE_VD55G1_SENSOR)
#include "cmw_vd55g1.h"
#endif
#if defined(USE_VD65G4_SENSOR)
#include "cmw_vd65g4.h"
#endif
#if defined(USE_IMX335_SENSOR)
#include "cmw_imx335.h"
#endif
#if defined(USE_OV5640_SENSOR)
#include "cmw_ov5640.h"
#endif
#if defined(USE_VD66GY_SENSOR)
#include "cmw_vd66gy.h"
#endif
#if defined(USE_VD56G3_SENSOR)
#include "cmw_vd56g3.h"
#endif
#if defined(USE_VD1943_SENSOR)
#include "cmw_vd1943.h"
#endif
#if defined (USE_VD5943_SENSOR)
#include "cmw_vd5943.h"
#endif
#if defined(USE_IMX219_SENSOR)
#include "cmw_imx219.h"
#endif
#include "assert.h"

typedef struct
{
  uint32_t Resolution;
  uint32_t pixel_format;
  uint32_t LightMode;
  uint32_t ColorEffect;
  int32_t  Brightness;
  int32_t  Saturation;
  int32_t  Contrast;
  int32_t  HueDegree;
  int32_t  Gain;
  int32_t  Exposure;
  int32_t  ExposureMode;
  uint32_t MirrorFlip;
  uint32_t Zoom;
  uint32_t NightMode;
  uint32_t IsMspCallbacksValid;
  uint32_t TestPattern;
} CAMERA_Ctx_t;

CMW_CameraInit_t  camera_conf;
CMW_Sensor_Name_t connected_sensor;
CAMERA_Ctx_t  Camera_Ctx;

DCMIPP_HandleTypeDef hcamera_dcmipp;
static CMW_Sensor_if_t Camera_Drv;

static union
{
#if defined(USE_IMX335_SENSOR)
  CMW_IMX335_t imx335_bsp;
#endif
#if defined(USE_VD55G1_SENSOR)
  CMW_VD55G1_t vd55g1_bsp;
#endif
#if defined(USE_VD65G4_SENSOR)
  CMW_VD65G4_t vd65g4_bsp;
#endif
#if defined(USE_VD66GY_SENSOR)
  CMW_VD66GY_t vd66gy_bsp;
#endif
#if defined(USE_VD56G3_SENSOR)
  CMW_VD56G3_t vd56g3_bsp;
#endif
#if defined(USE_OV5640_SENSOR)
  CMW_OV5640_t ov5640_bsp;
#endif
#if defined(USE_VD1943_SENSOR)
  CMW_VD1943_t vd1943_bsp;
#endif
#if defined(USE_VD5943_SENSOR)
  CMW_VD5943_t vd5943_bsp;
#endif
#if defined(USE_IMX219_SENSOR)
  CMW_IMX219_t imx219_bsp;
#endif
} camera_bsp;

int is_camera_init = 0;
int is_camera_started = 0;
int is_pipe1_2_shared = 0;

#if defined(USE_IMX335_SENSOR)
static int32_t CMW_CAMERA_IMX335_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_IMX219_SENSOR)
static int32_t CMW_CAMERA_IMX219_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD55G1_SENSOR)
static int32_t CMW_CAMERA_VD55G1_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD65G4_SENSOR)
static int32_t CMW_CAMERA_VD65G4_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_OV5640_SENSOR)
static int32_t CMW_CAMERA_OV5640_Init( CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD66GY_SENSOR)
static int32_t CMW_CAMERA_VD66GY_Init(CMW_Sensor_Init_t *initValues);
#endif
#if defined(USE_VD56G3_SENSOR)
static int32_t CMW_CAMERA_VD56G3_Init(CMW_Sensor_Init_t *initSensors_params);
#endif
#if defined(USE_VD1943_SENSOR)
static int32_t CMW_CAMERA_VD1943_Init(CMW_Sensor_Init_t *initValues);
#endif
#if defined(USE_VD5943_SENSOR)
static int32_t CMW_CAMERA_VD5943_Init(CMW_Sensor_Init_t *initValues);
#endif
static void CMW_CAMERA_EnableGPIOs(void);
static void CMW_CAMERA_PwrDown(void);
static int32_t CMW_CAMERA_SetPipe(DCMIPP_HandleTypeDef *hdcmipp, uint32_t pipe, CMW_DCMIPP_Conf_t *p_conf, uint32_t *pitch);
static int CMW_CAMERA_Probe_Sensor(CMW_Sensor_Init_t *initValues, CMW_Sensor_Name_t *sensorName);

static const char *CMW_CAMERA_SensorNameToString(CMW_Sensor_Name_t sensor)
{
  switch (sensor)
  {
    case CMW_VD66GY_Sensor: return "VD66GY";
    case CMW_VD56G3_Sensor: return "VD56G3";
    case CMW_IMX335_Sensor: return "IMX335";
    case CMW_OV5640_Sensor: return "OV5640";
    case CMW_VD55G1_Sensor: return "VD55G1";
    case CMW_VD65G4_Sensor: return "VD65G4";
    case CMW_VD1943_Sensor: return "VD1943";
    case CMW_VD5943_Sensor: return "VD5943";
    case CMW_IMX219_Sensor: return "IMX219";
    case CMW_UNKNOWN_Sensor:
    default: return "UNKNOWN";
  }
}

#if defined(USE_IMX219_SENSOR)
static void CMW_CAMERA_IMX219_SelectDefaultMode(CMW_Sensor_Init_t *initSensors_params)
{
  /*
   * When the application does not request a specific source mode, prefer the
   * highest-FOV mode that can sustain the requested frame rate.
   *
   *  - <= 15 fps: use the full 3280x2464 array
   *  - > 15 fps : use 1640x1232 2x2 binning for full FOV at 30 fps
   */
  if ((initSensors_params->width != 0U) && (initSensors_params->height != 0U))
  {
    return;
  }

  if (initSensors_params->fps <= 15)
  {
    initSensors_params->width = IMX219_MODE_FULL_WIDTH;
    initSensors_params->height = IMX219_MODE_FULL_HEIGHT;
  }
  else
  {
    initSensors_params->width = IMX219_MODE_BINNED_WIDTH;
    initSensors_params->height = IMX219_MODE_BINNED_HEIGHT;
  }
}
#endif

DCMIPP_HandleTypeDef* CMW_CAMERA_GetDCMIPPHandle(void)
{
    return &hcamera_dcmipp;
}

int32_t CMW_CAMERA_SetPipeConfig(uint32_t pipe, CMW_DCMIPP_Conf_t *p_conf, uint32_t *pitch)
{
  return CMW_CAMERA_SetPipe(&hcamera_dcmipp, pipe, p_conf, pitch);
}

/**
  * @brief  Get Sensor name.
  * @param  sensorName  Camera sensor name
  * @retval CMW status
  */
int32_t CMW_CAMERA_GetSensorName(CMW_Sensor_Name_t *sensorName)
{
  int32_t ret = CMW_ERROR_NONE;
  CMW_Sensor_Init_t initValues = {0};

  if (is_camera_init != 0)
  {
    *sensorName = connected_sensor;
    return CMW_ERROR_NONE;
  }

  initValues.width = 0;
  initValues.height = 0;
  initValues.fps = 30;
  initValues.mirrorFlip = CMW_MIRRORFLIP_NONE;
  initValues.sensor_config = NULL;

  /* Set DCMIPP instance */
  hcamera_dcmipp.Instance = DCMIPP;

  /* Configure DCMIPP clock */
  ret = MX_DCMIPP_ClockConfig(&hcamera_dcmipp);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }
  /* Enable DCMIPP clock */
  ret = HAL_DCMIPP_Init(&hcamera_dcmipp);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  CMW_CAMERA_EnableGPIOs();

  ret = CMW_CAMERA_Probe_Sensor(&initValues, &connected_sensor);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
  *sensorName = connected_sensor;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Set White Balance mode.
  * @param  Automatic  If not null, set automatic white balance mode
  * @param  RefColorTemp  If automatic is null, set white balance mode
  * @retval CMW status
  */
int32_t CMW_CAMERA_SetWBRefMode(uint8_t Automatic, uint32_t RefColorTemp)
{
  int ret;

  ret = Camera_Drv.SetWBRefMode(&camera_bsp, Automatic, RefColorTemp);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = CMW_ERROR_NONE;
  /* Return CMW status */
  return ret;
}

/**
  * @brief  Get White Balance reference modes list.
  * @param  RefColorTemp  White Balance reference modes
  * @retval CMW status
  */
int32_t CMW_CAMERA_ListWBRefModes(uint32_t RefColorTemp[])
{
  int ret;

