Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
  ret = Camera_Drv.ListWBRefModes(&camera_bsp, RefColorTemp);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = CMW_ERROR_NONE;
  /* Return CMW status */
  return ret;
}

/**
  * @brief  Probe camera sensor.
  * @param  initValues  Initialization values for the sensor
  * @param  sensorName  Camera sensor name
  * @retval CMW status
  */
static int CMW_CAMERA_Probe_Sensor(CMW_Sensor_Init_t *initValues, CMW_Sensor_Name_t *sensorName)
{
  int ret;
#if defined(USE_OV5640_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying OV5640\n");
  ret = CMW_CAMERA_OV5640_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: OV5640 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_OV5640_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected OV5640\n");
    return ret;
  }
#endif
#if defined(USE_VD55G1_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying VD55G1\n");
  ret = CMW_CAMERA_VD55G1_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: VD55G1 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD55G1_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected VD55G1\n");
    return ret;
  }
#endif
#if defined(USE_VD65G4_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying VD65G4\n");
  ret = CMW_CAMERA_VD65G4_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: VD65G4 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD65G4_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected VD65G4\n");
    return ret;
  }
#endif
#if defined(USE_VD66GY_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying VD66GY\n");
  ret = CMW_CAMERA_VD66GY_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: VD66GY ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD66GY_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected VD66GY\n");
    return ret;
  }
#endif
#if defined(USE_VD56G3_SENSOR)
  ret = CMW_CAMERA_VD56G3_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD56G3_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD1943_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying VD1943\n");
  ret = CMW_CAMERA_VD1943_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: VD1943 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD1943_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected VD1943\n");
    return ret;
  }
#endif
#if defined(USE_VD5943_SENSOR)
  ret = CMW_CAMERA_VD5943_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD5943_Sensor;
    return ret;
  }
#endif
#if defined(USE_IMX335_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying IMX335\n");
  ret = CMW_CAMERA_IMX335_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: IMX335 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_IMX335_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected IMX335\n");
    return ret;
  }
#endif
#if defined(USE_IMX219_SENSOR)
  printf("TRACE: CMW_CAMERA_Probe_Sensor: trying IMX219\n");
  ret = CMW_CAMERA_IMX219_Init(initValues);
  printf("TRACE: CMW_CAMERA_Probe_Sensor: IMX219 ret=%d\n", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_IMX219_Sensor;
    printf("TRACE: CMW_CAMERA_Probe_Sensor: selected IMX219\n");
    return ret;
  }
#endif
#if defined(USE_IMX219_SENSOR)
  ret = CMW_CAMERA_IMX219_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_IMX219_Sensor;
    return ret;
  }
#endif
  else
  {
    printf("ERROR: CMW_CAMERA_Probe_Sensor: no supported sensor detected\n");
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
}



/**
  * @brief  Initializes the camera.
  * @param  initConf  Mandatory: General camera config
  * @param  advanced_config  Optional: Sensor specific configuration
  * @retval CMW status
  */
int32_t CMW_CAMERA_Init(CMW_CameraInit_t *initConf, CMW_Advanced_Config_t *advanced_config)
{
  int32_t ret = CMW_ERROR_NONE;
  CMW_Sensor_Init_t initValues = {0};
  ISP_SensorInfoTypeDef info = {0};

  initValues.width = initConf->width;
  initValues.height = initConf->height;
  initValues.fps = initConf->fps;
  initValues.mirrorFlip = initConf->mirror_flip;
  printf("TRACE: CMW_CAMERA_Init: begin width=%lu height=%lu fps=%lu mirror=%lu advanced=%p\n",
         (unsigned long) initValues.width,
         (unsigned long) initValues.height,
         (unsigned long) initValues.fps,
         (unsigned long) initValues.mirrorFlip,
         advanced_config);

  if ((advanced_config != NULL) && (advanced_config->selected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* Assume The sensor is the one selected by the application. Check during probe */
    connected_sensor = advanced_config->selected_sensor;
    initValues.sensor_config = (void *) &advanced_config->config_sensor;
  }
  else
  {
    connected_sensor = CMW_UNKNOWN_Sensor;
    initValues.sensor_config = NULL;
  }

  /* Set DCMIPP instance */
  hcamera_dcmipp.Instance = DCMIPP;

  /* Configure DCMIPP clock */
  ret = MX_DCMIPP_ClockConfig(&hcamera_dcmipp);
  printf("TRACE: CMW_CAMERA_Init: MX_DCMIPP_ClockConfig ret=%ld\n", (long) ret);
  if (ret != HAL_OK)
  {
    printf("ERROR: CMW_CAMERA_Init: DCMIPP clock config failed ret=%ld\n", (long) ret);
    return CMW_ERROR_PERIPH_FAILURE;
  }
  /* Enable DCMIPP clock */
  ret = HAL_DCMIPP_Init(&hcamera_dcmipp);
  printf("TRACE: CMW_CAMERA_Init: HAL_DCMIPP_Init ret=%ld\n", (long) ret);
  if (ret != HAL_OK)
  {
    printf("ERROR: CMW_CAMERA_Init: HAL_DCMIPP_Init failed ret=%ld\n", (long) ret);
    return CMW_ERROR_PERIPH_FAILURE;
  }

  CMW_CAMERA_EnableGPIOs();
  printf("TRACE: CMW_CAMERA_Init: camera GPIOs enabled\n");

  ret = CMW_CAMERA_Probe_Sensor(&initValues, &connected_sensor);
  printf("TRACE: CMW_CAMERA_Init: CMW_CAMERA_Probe_Sensor ret=%ld connected=%s width=%lu height=%lu\n",
         (long) ret,
         CMW_CAMERA_SensorNameToString(connected_sensor),
         (unsigned long) initValues.width,
         (unsigned long) initValues.height);
  if (ret != CMW_ERROR_NONE)
  {
    printf("ERROR: CMW_CAMERA_Init: sensor probe failed ret=%ld\n", (long) ret);
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }

  /* Configure exposure and gain for a more suitable quality */
  ret = CMW_CAMERA_GetSensorInfo(&info);
  printf("TRACE: CMW_CAMERA_Init: CMW_CAMERA_GetSensorInfo ret=%ld sensor=%s info=%lux%lu gain=[%ld,%ld] exposure=[%ld,%ld]\n",
         (long) ret,
         info.name,
         (unsigned long) info.width,
         (unsigned long) info.height,
         (long) info.gain_min,
         (long) info.gain_max,
         (long) info.exposure_min,
         (long) info.exposure_max);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    printf("ERROR: CMW_CAMERA_Init: CMW_CAMERA_GetSensorInfo failed\n");
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
  ret = CMW_CAMERA_SetExposure(info.exposure_min);
  printf("TRACE: CMW_CAMERA_Init: CMW_CAMERA_SetExposure(%ld) ret=%ld\n",
         (long) info.exposure_min, (long) ret);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    printf("ERROR: CMW_CAMERA_Init: CMW_CAMERA_SetExposure failed ret=%ld\n", (long) ret);
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
  ret = CMW_CAMERA_SetGain(info.gain_min);
  printf("TRACE: CMW_CAMERA_Init: CMW_CAMERA_SetGain(%ld) ret=%ld\n",
         (long) info.gain_min, (long) ret);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    printf("ERROR: CMW_CAMERA_Init: CMW_CAMERA_SetGain failed ret=%ld\n", (long) ret);
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }

  /* Write back the initValue width and height that might be changed */
  initConf->width = initValues.width;
  initConf->height = initValues.height ;
  camera_conf = *initConf;

