Wafleem/STM32N6-EdgeAI-CV/Middlewares/stm32-mw-camera/cmw_camera.c
  return CMW_ERROR_NONE;
}

int32_t CMW_CAMERA_SetDefaultSensorValues( CMW_Advanced_Config_t *advanced_config )
{
  if (advanced_config == NULL)
  {
    return CMW_ERROR_WRONG_PARAM;
  }
  switch (advanced_config->selected_sensor)
  {
#if defined(USE_VD66GY_SENSOR)
  case CMW_VD66GY_Sensor:
    CMW_VD66GY_SetDefaultSensorValues(&advanced_config->config_sensor.vd66gy_config);
    break;
#endif
#if defined(USE_VD55G1_SENSOR)
  case CMW_VD55G1_Sensor:
    CMW_VD55G1_SetDefaultSensorValues(&advanced_config->config_sensor.vd55g1_config);
    break;
#endif
#if defined(USE_VD65G4_SENSOR)
  case CMW_VD65G4_Sensor:
    CMW_VD65G4_SetDefaultSensorValues(&advanced_config->config_sensor.vd65g4_config);
    break;
#endif
#if defined(USE_IMX335_SENSOR)
  case CMW_IMX335_Sensor:
    CMW_IMX335_SetDefaultSensorValues(&advanced_config->config_sensor.imx335_config);
    break;
#endif
#if defined(USE_OV5640_SENSOR)
  case CMW_OV5640_Sensor:
    CMW_OV5640_SetDefaultSensorValues(&advanced_config->config_sensor.ov5640_config);
    break;
#endif
#if defined(USE_VD1943_SENSOR)
  case CMW_VD1943_Sensor:
    CMW_VD1943_SetDefaultSensorValues(&advanced_config->config_sensor.vd1943_config);
    break;
#endif
#if defined(USE_VD5943_SENSOR)
  case CMW_VD5943_Sensor:
    CMW_VD5943_SetDefaultSensorValues(&advanced_config->config_sensor.vd5943_config);
    break;
#endif
#if defined(USE_IMX219_SENSOR)
  case CMW_IMX219_Sensor:
    CMW_IMX219_SetDefaultSensorValues(&advanced_config->config_sensor.imx219_config);
    break;
#endif
  default:
    return CMW_ERROR_WRONG_PARAM;
    break;
  }

  return CMW_ERROR_NONE;
}

/**
  * @brief  Error callback on the pipe. Occurs when overrun occurs on the pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval None
  */
void HAL_DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  UNUSED(hdcmipp);

  CMW_CAMERA_PIPE_ErrorCallback(Pipe);
}
